/*
SQLyog Ultimate v12.4.0 (64 bit)
MySQL - 5.5.53 : Database - spring_study
*********************************************************************
*/

/*!40101 SET NAMES utf8 */;

/*!40101 SET SQL_MODE=''*/;

/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;
CREATE DATABASE /*!32312 IF NOT EXISTS*/`spring_study` /*!40100 DEFAULT CHARACTER SET utf8 */;

USE `spring_study`;

/*Table structure for table `book` */

DROP TABLE IF EXISTS `book`;

CREATE TABLE `book` (
  `book_id` bigint(20) NOT NULL AUTO_INCREMENT COMMENT '图书ID',
  `name` varchar(100) NOT NULL COMMENT '图书名称',
  `number` int(11) NOT NULL COMMENT '馆藏数量',
  PRIMARY KEY (`book_id`)
) ENGINE=InnoDB AUTO_INCREMENT=1481 DEFAULT CHARSET=utf8 COMMENT='图书表';

/*Data for the table `book` */

insert  into `book`(`book_id`,`name`,`number`) values 
(1000,'Java程序设计',10),
(1002,'设计模式',11),
(1003,'编译原理',10),
(1021,'23424',23424),
(1022,'2342347777',23423),
(1023,'231424',234324),
(1025,'234234',23424),
(1033,'23423',234),
(1034,'234',234),
(1035,'234',234),
(1036,'234',234),
(1037,'Java程序设计',10),
(1038,'数据结构',10),
(1039,'设计模式11',11),
(1040,'Java程序设计',10),
(1042,'设计模式',11),
(1071,'数据结构',12),
(1072,'设计模式',11),
(1074,'数据结构',10),
(1075,'设计模式',11),
(1076,'Java程序设计',10),
(1078,'设计模式',11),
(1079,'Java程序设计',10),
(1080,'数据结构',10),
(1081,'设计模式',11),
(1082,'Java程序设计',10),
(1083,'数据结构ddd',10),
(1084,'设计模式',11),
(1085,'Java程序设计',10),
(1086,'数据结构',10),
(1087,'设计模式',11),
(1088,'Java程序设计',10),
(1089,'数据结构',10),
(1090,'设计模式',11),
(1091,'Java程序设计',10),
(1092,'数据结构',10),
(1093,'设计模式',11),
(1094,'Java程序设计',10),
(1097,'Java程序设计',10),
(1099,'设计模式',11),
(1100,'Java程序设计',10),
(1101,'数据结构',10),
(1103,'Java程序设计',10),
(1104,'数据结构',10),
(1105,'设计模式',11),
(1106,'Java程序设计',10),
(1107,'数据结构',10),
(1109,'Java程序设计',10),
(1110,'数据结构',101),
(1112,'Java程序设计',10),
(1113,'数据结构',10),
(1114,'设计模式',11),
(1115,'Java程序设计',10),
(1116,'数据结构',10),
(1118,'Java程序设计',10),
(1119,'数据结构',10),
(1120,'设计模式',11),
(1121,'Java程序设计',10),
(1122,'数据结构',10),
(1123,'设计模式',11),
(1124,'Java程序设计',10),
(1125,'数据结构',10),
(1126,'设计模式',11),
(1127,'Java程序设计',10),
(1128,'数据结构',10),
(1130,'Java程序设计',10),
(1131,'数据结构',10),
(1132,'设计模式',11),
(1133,'Java程序设计',10),
(1134,'数据结构',10),
(1135,'设计模式',11),
(1136,'Java程序设计',10),
(1137,'数据结构',10),
(1138,'设计模式',11),
(1139,'Java程序设计',10),
(1140,'数据结构',10),
(1141,'设计模式',11),
(1142,'Java程序设计',10),
(1143,'数据结构',10),
(1144,'设计模式',11),
(1145,'Java程序设计',10),
(1146,'数据结构',10),
(1147,'设计模式',11),
(1148,'Java程序设计',10),
(1149,'数据结构',10),
(1150,'设计模式',11),
(1151,'Java程序设计',10),
(1152,'数据结构',10),
(1153,'设计模式',11),
(1154,'Java程序设计',10),
(1155,'数据结构',10),
(1156,'设计模式',11),
(1157,'Java程序设计',10),
(1158,'数据结构',10),
(1159,'设计模式',11),
(1161,'数据结构',10),
(1162,'设计模式',11),
(1163,'Java程序设计',10),
(1164,'数据结构',10),
(1165,'设计模式',11),
(1166,'Java程序设计',10),
(1167,'数据结构',10),
(1168,'设计模式',11),
(1169,'Java程序设计',10),
(1170,'数据结构',10),
(1171,'设计模式',11),
(1172,'Java程序设计',10),
(1173,'数据结构',10),
(1174,'设计模式',11),
(1175,'Java程序设计',10),
(1176,'数据结构',10),
(1177,'设计模式',11),
(1178,'Java程序设计',10),
(1179,'数据结构',10),
(1180,'设计模式',11),
(1181,'Java程序设计',10),
(1182,'数据结构',10),
(1183,'设计模式',11),
(1184,'Java程序设计',10),
(1185,'数据结构',10),
(1186,'设计模式',11),
(1187,'Java程序设计',10),
(1188,'数据结构',10),
(1189,'设计模式',11),
(1190,'Java程序设计',10),
(1191,'数据结构',10),
(1192,'设计模式',11),
(1193,'Java程序设计',10),
(1194,'数据结构',10),
(1195,'设计模式',11),
(1196,'Java程序设计',10),
(1197,'数据结构',10),
(1198,'设计模式',11),
(1199,'Java程序设计',10),
(1200,'数据结构',10),
(1201,'设计模式',11),
(1202,'Java程序设计',10),
(1203,'数据结构',10),
(1204,'设计模式',11),
(1205,'Java程序设计',10),
(1206,'数据结构',10),
(1207,'设计模式',11),
(1208,'Java程序设计',10),
(1209,'数据结构',10),
(1210,'设计模式',11),
(1211,'Java程序设计',10),
(1212,'数据结构',10),
(1213,'设计模式',11),
(1214,'Java程序设计',10),
(1215,'数据结构',10),
(1216,'设计模式',11),
(1217,'Java程序设计',10),
(1218,'数据结构',10),
(1219,'设计模式',11),
(1220,'Java程序设计',10),
(1221,'数据结构',10),
(1222,'设计模式',11),
(1223,'Java程序设计',10),
(1224,'数据结构',10),
(1225,'设计模式',11),
(1226,'Java程序设计',10),
(1227,'数据结构',10),
(1228,'设计模式',11),
(1229,'Java程序设计',10),
(1230,'数据结构',10),
(1231,'设计模式',11),
(1232,'Java程序设计',10),
(1233,'数据结构',10),
(1234,'设计模式',11),
(1235,'Java程序设计',10),
(1236,'数据结构',10),
(1237,'设计模式',11),
(1238,'Java程序设计',10),
(1239,'数据结构',10),
(1240,'设计模式',11),
(1241,'Java程序设计',10),
(1242,'数据结构',10),
(1243,'设计模式',11),
(1244,'Java程序设计',10),
(1245,'数据结构',10),
(1246,'设计模式',11),
(1247,'Java程序设计',10),
(1248,'数据结构',10),
(1249,'设计模式',11),
(1250,'Java程序设计',10),
(1251,'数据结构',10),
(1252,'设计模式',11),
(1253,'Java程序设计',10),
(1254,'数据结构',10),
(1255,'设计模式',11),
(1256,'Java程序设计',10),
(1257,'数据结构',10),
(1258,'设计模式',11),
(1259,'Java程序设计',10),
(1260,'数据结构',10),
(1261,'设计模式',11),
(1262,'Java程序设计',10),
(1263,'数据结构',10),
(1264,'设计模式',11),
(1265,'Java程序设计',10),
(1266,'数据结构',10),
(1267,'设计模式',11),
(1268,'Java程序设计',10),
(1269,'数据结构',10),
(1270,'设计模式',11),
(1271,'Java程序设计',10),
(1272,'数据结构',10),
(1273,'设计模式',11),
(1274,'Java程序设计',10),
(1275,'数据结构',10),
(1276,'设计模式',11),
(1277,'Java程序设计',10),
(1278,'数据结构',10),
(1279,'设计模式',11),
(1280,'Java程序设计',10),
(1281,'数据结构',10),
(1282,'设计模式',11),
(1283,'Java程序设计',10),
(1284,'数据结构',10),
(1285,'设计模式',11),
(1286,'Java程序设计',10),
(1287,'数据结构',10),
(1288,'设计模式',11),
(1289,'Java程序设计',10),
(1290,'数据结构',10),
(1291,'设计模式',11),
(1292,'Java程序设计',10),
(1293,'数据结构',10),
(1294,'设计模式',11),
(1295,'Java程序设计',10),
(1296,'数据结构',10),
(1297,'设计模式',11),
(1298,'Java程序设计',10),
(1299,'数据结构',10),
(1300,'设计模式',11),
(1301,'Java程序设计',10),
(1302,'数据结构',10),
(1303,'设计模式',11),
(1304,'Java程序设计',10),
(1305,'数据结构',10),
(1306,'设计模式',11),
(1307,'Java程序设计',10),
(1308,'数据结构',10),
(1309,'设计模式',11),
(1310,'Java程序设计',10),
(1311,'数据结构',10),
(1312,'设计模式',11),
(1313,'Java程序设计',10),
(1314,'数据结构',10),
(1315,'设计模式',11),
(1316,'Java程序设计',10),
(1317,'数据结构',10),
(1318,'设计模式',11),
(1319,'Java程序设计',10),
(1320,'数据结构',10),
(1321,'设计模式',11),
(1322,'Java程序设计',10),
(1323,'数据结构',10),
(1324,'设计模式',11),
(1325,'Java程序设计',10),
(1326,'数据结构',10),
(1327,'设计模式',11),
(1328,'Java程序设计',10),
(1329,'数据结构',10),
(1330,'设计模式',11),
(1331,'Java程序设计',10),
(1332,'数据结构',10),
(1333,'设计模式',11),
(1334,'Java程序设计',10),
(1335,'数据结构',10),
(1336,'设计模式',11),
(1337,'Java程序设计',10),
(1338,'数据结构',10),
(1339,'设计模式',11),
(1340,'Java程序设计',10),
(1341,'数据结构',10),
(1342,'设计模式',11),
(1343,'Java程序设计',10),
(1344,'数据结构',10),
(1345,'设计模式',11),
(1346,'Java程序设计',10),
(1347,'数据结构',10),
(1348,'设计模式',11),
(1349,'Java程序设计',10),
(1350,'数据结构',10),
(1351,'设计模式',11),
(1352,'Java程序设计',10),
(1353,'数据结构',10),
(1354,'设计模式',11),
(1355,'Java程序设计',10),
(1356,'数据结构',10),
(1357,'设计模式',11),
(1358,'Java程序设计',10),
(1359,'数据结构',10),
(1360,'设计模式',11),
(1361,'Java程序设计',10),
(1362,'数据结构',10),
(1363,'设计模式',11),
(1364,'Java程序设计',10),
(1365,'数据结构',10),
(1366,'设计模式',11),
(1367,'Java程序设计',10),
(1368,'数据结构',10),
(1369,'设计模式',11),
(1370,'Java程序设计',10),
(1371,'数据结构',10),
(1372,'设计模式',11),
(1373,'Java程序设计',10),
(1374,'数据结构',10),
(1375,'设计模式',11),
(1376,'Java程序设计',10),
(1377,'数据结构',10),
(1378,'设计模式',11),
(1379,'Java程序设计',10),
(1380,'数据结构',10),
(1381,'设计模式',11),
(1382,'Java程序设计',10),
(1383,'数据结构',10),
(1384,'设计模式',11),
(1385,'Java程序设计',10),
(1386,'数据结构',10),
(1387,'设计模式',11),
(1388,'Java程序设计',10),
(1389,'数据结构',10),
(1390,'设计模式',11),
(1391,'Java程序设计',10),
(1392,'数据结构',10),
(1393,'设计模式',11),
(1394,'Java程序设计',10),
(1395,'数据结构',10),
(1396,'设计模式',11),
(1397,'Java程序设计',10),
(1398,'数据结构',10),
(1399,'设计模式',11),
(1400,'Java程序设计',10),
(1401,'数据结构',10),
(1402,'设计模式',11),
(1403,'Java程序设计',10),
(1404,'数据结构',10),
(1405,'设计模式',11),
(1406,'Java程序设计',10),
(1407,'数据结构',10),
(1408,'设计模式',11),
(1409,'Java程序设计',10),
(1410,'数据结构',10),
(1411,'设计模式',11),
(1412,'Java程序设计',10),
(1413,'数据结构',10),
(1414,'设计模式',11),
(1415,'Java程序设计',10),
(1416,'数据结构',10),
(1417,'设计模式',11),
(1418,'Java程序设计',10),
(1419,'数据结构',10),
(1420,'设计模式',11),
(1421,'Java程序设计',10),
(1422,'数据结构',10),
(1423,'设计模式',11),
(1424,'Java程序设计',10),
(1425,'数据结构',10),
(1426,'设计模式',11),
(1427,'Java程序设计',10),
(1428,'数据结构',10),
(1429,'设计模式',11),
(1430,'Java程序设计',10),
(1431,'数据结构',10),
(1432,'设计模式',11),
(1433,'Java程序设计',10),
(1434,'数据结构',10),
(1435,'设计模式',11),
(1436,'Java程序设计',10),
(1437,'数据结构',10),
(1438,'设计模式',11),
(1439,'Java程序设计',10),
(1440,'数据结构',10),
(1441,'设计模cccc',11),
(1442,'Java程序设计',10),
(1443,'数据结构',10),
(1444,'设计模式',11),
(1445,'Java程序设计',10),
(1446,'数据结构',10),
(1447,'设计模式',11),
(1448,'Java程序设计',10),
(1449,'数据结构',10),
(1450,'设计模式',11),
(1451,'Java程序设计',10),
(1452,'数据结构',10),
(1453,'设计模式',11),
(1454,'Java程序设计',10),
(1455,'数据结构',10),
(1456,'设计模式',11),
(1457,'Java程序设计',10),
(1458,'数据结构',10),
(1459,'设计模式',11),
(1460,'Java程序设计',10),
(1461,'数据结构',10),
(1462,'设计模式',11),
(1463,'Java程序设计',10),
(1464,'数据结构',10),
(1465,'设计模式',11),
(1466,'Java程序设计',10),
(1467,'数据结构',10),
(1468,'设计模式',11),
(1469,'Java程序设计',10),
(1470,'数据结构',10),
(1471,'设计模式',11),
(1472,'Java程序设计',10),
(1473,'数据结构',10),
(1474,'设计模式',11),
(1480,'工工工',333);

/*Table structure for table `user_info` */

DROP TABLE IF EXISTS `user_info`;

CREATE TABLE `user_info` (
  `user_id` int(11) NOT NULL AUTO_INCREMENT,
  `user_name` varchar(255) NOT NULL,
  `password` varchar(255) NOT NULL,
  `phone` varchar(255) NOT NULL,
  PRIMARY KEY (`user_id`)
) ENGINE=InnoDB AUTO_INCREMENT=1046 DEFAULT CHARSET=utf8;

/*Data for the table `user_info` */

insert  into `user_info`(`user_id`,`user_name`,`password`,`phone`) values 
(1,'zhansan','aaaaa','13333333333'),
(2,'lisi','bbbbb','15555555555'),
(11,'test','pppp','133333333333'),
(23,'test','pppp','133333333333'),
(1000,'test','pppp','133333333333'),
(1001,'test','pppp','133333333333'),
(1002,'test','pppp','133333333333'),
(1003,'test','pppp','133333333333'),
(1004,'test','pppp','133333333333'),
(1005,'test','pppp','133333333333'),
(1006,'test','pppp','133333333333'),
(1007,'test','pppp','133333333333'),
(1008,'test','pppp','133333333333'),
(1009,'test','pppp','133333333333'),
(1010,'test','pppp','133333333333'),
(1011,'test','pppp','133333333333'),
(1012,'test','pppp','133333333333'),
(1013,'test','pppp','133333333333'),
(1014,'test','pppp','133333333333'),
(1015,'test','pppp','133333333333'),
(1016,'test','pppp','133333333333'),
(1017,'test','pppp','133333333333'),
(1018,'test','pppp','133333333333'),
(1019,'test','pppp','133333333333'),
(1020,'asdfasf','asfdasf','13333333'),
(1021,'aaaaaaaaaaa','cccccccccccc','133333334444'),
(1022,'aaaaaaaaaaa','cccccccccccc','133333334444'),
(1023,'aaaaaaaaaaa','cccccccccccc','133333334444'),
(1024,'aaaaaaaaaaa','cccccccccccc','133333334444'),
(1025,'aaaaaaaaaaa','cccccccccccc','133333334444'),
(1026,'aaaaaaaaaaa','cccccccccccc','133333334444'),
(1027,'aaaaaaaaaaa','cccccccccccc','133333334444'),
(1028,'aaaaaaaaaaa','cccccccccccc','133333334444'),
(1029,'aaaaaaaaaaa','cccccccccccc','133333334444'),
(1030,'aaaaaaaaaaa','cccccccccccc','133333334444'),
(1031,'aaaaaaaaaaa','cccccccccccc','133333334444'),
(1032,'aaaaaaaaaaa','cccccccccccc','133333334444'),
(1033,'aaaaaaaaaaa','cccccccccccc','133333334444'),
(1034,'aaaaaaaaaaa','cccccccccccc','133333334444'),
(1035,'aaaaaaaaaaa','cccccccccccc','133333334444'),
(1036,'aaaaaaaaaaa','cccccccccccc','133333334444'),
(1037,'aaaaaaaaaaa','cccccccccccc','133333334444'),
(1038,'aaaaaaaaaaa','cccccccccccc','133333334444'),
(1039,'aaaaaaaaaaa','cccccccccccc','133333334444'),
(1040,'aaaaaaaaaaa','cccccccccccc','133333334444'),
(1041,'aaaaaaaaaaa','cccccccccccc','133333334444'),
(1042,'aaaaaaaaaaa','cccccccccccc','133333334444'),
(1043,'aaaaaaaaaaa','cccccccccccc','133333334444'),
(1044,'aaaaaaaaaaa','cccccccccccc','133333334444'),
(1045,'aaaaaaaaaaa','cccccccccccc','133333334444');

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;
